GopalSaraf/Practicals/PSDL/include/proc/pic16lf1947.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 028Ch
// bitfield definitions
PORTF_RF0_POSN                           equ 0000h
PORTF_RF0_POSITION                       equ 0000h
PORTF_RF0_SIZE                           equ 0001h
PORTF_RF0_LENGTH                         equ 0001h
PORTF_RF0_MASK                           equ 0001h
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h
PORTF_AN16_POSN                          equ 0000h
PORTF_AN16_POSITION                      equ 0000h
PORTF_AN16_SIZE                          equ 0001h
PORTF_AN16_LENGTH                        equ 0001h
PORTF_AN16_MASK                          equ 0001h
PORTF_AN6_POSN                           equ 0001h
PORTF_AN6_POSITION                       equ 0001h
PORTF_AN6_SIZE                           equ 0001h
PORTF_AN6_LENGTH                         equ 0001h
PORTF_AN6_MASK                           equ 0002h
PORTF_AN7_POSN                           equ 0002h
PORTF_AN7_POSITION                       equ 0002h
PORTF_AN7_SIZE                           equ 0001h
PORTF_AN7_LENGTH                         equ 0001h
PORTF_AN7_MASK                           equ 0004h
PORTF_AN8_POSN                           equ 0003h
PORTF_AN8_POSITION                       equ 0003h
PORTF_AN8_SIZE                           equ 0001h
PORTF_AN8_LENGTH                         equ 0001h
PORTF_AN8_MASK                           equ 0008h
PORTF_AN9_POSN                           equ 0004h
PORTF_AN9_POSITION                       equ 0004h
PORTF_AN9_SIZE                           equ 0001h
PORTF_AN9_LENGTH                         equ 0001h
PORTF_AN9_MASK                           equ 0010h
PORTF_AN10_POSN                          equ 0005h
PORTF_AN10_POSITION                      equ 0005h
PORTF_AN10_SIZE                          equ 0001h
PORTF_AN10_LENGTH                        equ 0001h
PORTF_AN10_MASK                          equ 0020h
PORTF_AN11_POSN                          equ 0006h
PORTF_AN11_POSITION                      equ 0006h
PORTF_AN11_SIZE                          equ 0001h
PORTF_AN11_LENGTH                        equ 0001h
PORTF_AN11_MASK                          equ 0040h
PORTF_AN5_POSN                           equ 0007h
PORTF_AN5_POSITION                       equ 0007h
PORTF_AN5_SIZE                           equ 0001h
PORTF_AN5_LENGTH                         equ 0001h
PORTF_AN5_MASK                           equ 0080h
PORTF_SEG41_POSN                         equ 0000h
PORTF_SEG41_POSITION                     equ 0000h
PORTF_SEG41_SIZE                         equ 0001h
PORTF_SEG41_LENGTH                       equ 0001h
PORTF_SEG41_MASK                         equ 0001h
PORTF_SEG19_POSN                         equ 0001h
PORTF_SEG19_POSITION                     equ 0001h
PORTF_SEG19_SIZE                         equ 0001h
PORTF_SEG19_LENGTH                       equ 0001h
PORTF_SEG19_MASK                         equ 0002h
PORTF_SEG20_POSN                         equ 0002h
PORTF_SEG20_POSITION                     equ 0002h
PORTF_SEG20_SIZE                         equ 0001h
PORTF_SEG20_LENGTH                       equ 0001h
PORTF_SEG20_MASK                         equ 0004h
PORTF_SEG21_POSN                         equ 0003h
PORTF_SEG21_POSITION                     equ 0003h
PORTF_SEG21_SIZE                         equ 0001h
PORTF_SEG21_LENGTH                       equ 0001h
PORTF_SEG21_MASK                         equ 0008h
PORTF_SEG22_POSN                         equ 0004h
PORTF_SEG22_POSITION                     equ 0004h
PORTF_SEG22_SIZE                         equ 0001h
PORTF_SEG22_LENGTH                       equ 0001h
PORTF_SEG22_MASK                         equ 0010h
PORTF_SEG23_POSN                         equ 0005h
PORTF_SEG23_POSITION                     equ 0005h
PORTF_SEG23_SIZE                         equ 0001h
PORTF_SEG23_LENGTH                       equ 0001h
PORTF_SEG23_MASK                         equ 0020h
PORTF_SEG24_POSN                         equ 0006h
PORTF_SEG24_POSITION                     equ 0006h
PORTF_SEG24_SIZE                         equ 0001h
PORTF_SEG24_LENGTH                       equ 0001h
PORTF_SEG24_MASK                         equ 0040h
PORTF_SEG25_POSN                         equ 0007h
PORTF_SEG25_POSITION                     equ 0007h
PORTF_SEG25_SIZE                         equ 0001h
PORTF_SEG25_LENGTH                       equ 0001h
PORTF_SEG25_MASK                         equ 0080h
PORTF_CPS16_POSN                         equ 0000h
PORTF_CPS16_POSITION                     equ 0000h
PORTF_CPS16_SIZE                         equ 0001h
PORTF_CPS16_LENGTH                       equ 0001h
PORTF_CPS16_MASK                         equ 0001h
PORTF_CPS6_POSN                          equ 0001h
PORTF_CPS6_POSITION                      equ 0001h
PORTF_CPS6_SIZE                          equ 0001h
PORTF_CPS6_LENGTH                        equ 0001h
PORTF_CPS6_MASK                          equ 0002h
PORTF_CPS7_POSN                          equ 0002h
PORTF_CPS7_POSITION                      equ 0002h
PORTF_CPS7_SIZE                          equ 0001h
PORTF_CPS7_LENGTH                        equ 0001h
PORTF_CPS7_MASK                          equ 0004h
PORTF_CPS8_POSN                          equ 0003h
PORTF_CPS8_POSITION                      equ 0003h
PORTF_CPS8_SIZE                          equ 0001h
PORTF_CPS8_LENGTH                        equ 0001h
PORTF_CPS8_MASK                          equ 0008h
PORTF_CPS9_POSN                          equ 0004h
PORTF_CPS9_POSITION                      equ 0004h
PORTF_CPS9_SIZE                          equ 0001h
PORTF_CPS9_LENGTH                        equ 0001h
PORTF_CPS9_MASK                          equ 0010h
PORTF_CPS10_POSN                         equ 0005h
PORTF_CPS10_POSITION                     equ 0005h
PORTF_CPS10_SIZE                         equ 0001h
PORTF_CPS10_LENGTH                       equ 0001h
PORTF_CPS10_MASK                         equ 0020h
PORTF_CPS11_POSN                         equ 0006h
PORTF_CPS11_POSITION                     equ 0006h
PORTF_CPS11_SIZE                         equ 0001h
PORTF_CPS11_LENGTH                       equ 0001h
PORTF_CPS11_MASK                         equ 0040h
PORTF_CPS5_POSN                          equ 0007h
PORTF_CPS5_POSITION                      equ 0007h
PORTF_CPS5_SIZE                          equ 0001h
PORTF_CPS5_LENGTH                        equ 0001h
PORTF_CPS5_MASK                          equ 0080h
PORTF_C1IN0N_POSN                        equ 0000h
PORTF_C1IN0N_POSITION                    equ 0000h
PORTF_C1IN0N_SIZE                        equ 0001h
PORTF_C1IN0N_LENGTH                      equ 0001h
PORTF_C1IN0N_MASK                        equ 0001h
PORTF_C2OUT_POSN                         equ 0001h
PORTF_C2OUT_POSITION                     equ 0001h
PORTF_C2OUT_SIZE                         equ 0001h
PORTF_C2OUT_LENGTH                       equ 0001h
PORTF_C2OUT_MASK                         equ 0002h
PORTF_C1OUT_POSN                         equ 0002h
PORTF_C1OUT_POSITION                     equ 0002h
PORTF_C1OUT_SIZE                         equ 0001h
PORTF_C1OUT_LENGTH                       equ 0001h
PORTF_C1OUT_MASK                         equ 0004h
PORTF_C1IN2N_POSN                        equ 0003h
PORTF_C1IN2N_POSITION                    equ 0003h
PORTF_C1IN2N_SIZE                        equ 0001h
PORTF_C1IN2N_LENGTH                      equ 0001h
PORTF_C1IN2N_MASK                        equ 0008h
PORTF_C2INP_POSN                         equ 0004h
PORTF_C2INP_POSITION                     equ 0004h
PORTF_C2INP_SIZE                         equ 0001h
PORTF_C2INP_LENGTH                       equ 0001h
PORTF_C2INP_MASK                         equ 0010h
PORTF_C1IN1N_POSN                        equ 0005h
PORTF_C1IN1N_POSITION                    equ 0005h
PORTF_C1IN1N_SIZE                        equ 0001h
PORTF_C1IN1N_LENGTH                      equ 0001h
PORTF_C1IN1N_MASK                        equ 0020h
PORTF_C1INP_POSN                         equ 0006h
PORTF_C1INP_POSITION                     equ 0006h
PORTF_C1INP_SIZE                         equ 0001h
PORTF_C1INP_LENGTH                       equ 0001h
PORTF_C1INP_MASK                         equ 0040h
PORTF_C1IN3N_POSN                        equ 0007h
PORTF_C1IN3N_POSITION                    equ 0007h
PORTF_C1IN3N_SIZE                        equ 0001h
PORTF_C1IN3N_LENGTH                      equ 0001h
PORTF_C1IN3N_MASK                        equ 0080h
PORTF_C2IN0N_POSN                        equ 0000h
PORTF_C2IN0N_POSITION                    equ 0000h
PORTF_C2IN0N_SIZE                        equ 0001h
PORTF_C2IN0N_LENGTH                      equ 0001h
PORTF_C2IN0N_MASK                        equ 0001h
PORTF_SRNQ_POSN                          equ 0001h
PORTF_SRNQ_POSITION                      equ 0001h
PORTF_SRNQ_SIZE                          equ 0001h
PORTF_SRNQ_LENGTH                        equ 0001h
PORTF_SRNQ_MASK                          equ 0002h
PORTF_SRQ_POSN                           equ 0002h
PORTF_SRQ_POSITION                       equ 0002h
PORTF_SRQ_SIZE                           equ 0001h
PORTF_SRQ_LENGTH                         equ 0001h
PORTF_SRQ_MASK                           equ 0004h
PORTF_C2IN2N_POSN                        equ 0003h
PORTF_C2IN2N_POSITION                    equ 0003h
PORTF_C2IN2N_SIZE                        equ 0001h
PORTF_C2IN2N_LENGTH                      equ 0001h
PORTF_C2IN2N_MASK                        equ 0008h
PORTF_C2IN1N_POSN                        equ 0005h
PORTF_C2IN1N_POSITION                    equ 0005h
PORTF_C2IN1N_SIZE                        equ 0001h
PORTF_C2IN1N_LENGTH                      equ 0001h
PORTF_C2IN1N_MASK                        equ 0020h
PORTF_C2IN3N_POSN                        equ 0007h
PORTF_C2IN3N_POSITION                    equ 0007h
PORTF_C2IN3N_SIZE                        equ 0001h
PORTF_C2IN3N_LENGTH                      equ 0001h
PORTF_C2IN3N_MASK                        equ 0080h
PORTF_C3IN2N_POSN                        equ 0003h
PORTF_C3IN2N_POSITION                    equ 0003h
PORTF_C3IN2N_SIZE                        equ 0001h
PORTF_C3IN2N_LENGTH                      equ 0001h
PORTF_C3IN2N_MASK                        equ 0008h
PORTF_DACOUT_POSN                        equ 0005h
PORTF_DACOUT_POSITION                    equ 0005h
PORTF_DACOUT_SIZE                        equ 0001h
PORTF_DACOUT_LENGTH                      equ 0001h
PORTF_DACOUT_MASK                        equ 0020h
PORTF_C3IN3N_POSN                        equ 0007h
PORTF_C3IN3N_POSITION                    equ 0007h
PORTF_C3IN3N_SIZE                        equ 0001h
PORTF_C3IN3N_LENGTH                      equ 0001h
PORTF_C3IN3N_MASK                        equ 0080h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 028Dh
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_AN15_POSN                          equ 0001h
PORTG_AN15_POSITION                      equ 0001h
PORTG_AN15_SIZE                          equ 0001h
PORTG_AN15_LENGTH                        equ 0001h
PORTG_AN15_MASK                          equ 0002h
PORTG_AN14_POSN                          equ 0002h
PORTG_AN14_POSITION                      equ 0002h
PORTG_AN14_SIZE                          equ 0001h
PORTG_AN14_LENGTH                        equ 0001h
PORTG_AN14_MASK                          equ 0004h
PORTG_AN13_POSN                          equ 0003h
PORTG_AN13_POSITION                      equ 0003h
PORTG_AN13_SIZE                          equ 0001h
PORTG_AN13_LENGTH                        equ 0001h
PORTG_AN13_MASK                          equ 0008h
PORTG_AN12_POSN                          equ 0004h
PORTG_AN12_POSITION                      equ 0004h
PORTG_AN12_SIZE                          equ 0001h
PORTG_AN12_LENGTH                        equ 0001h
PORTG_AN12_MASK                          equ 0010h
PORTG_nMCLR_POSN                         equ 0005h
PORTG_nMCLR_POSITION                     equ 0005h
PORTG_nMCLR_SIZE                         equ 0001h
PORTG_nMCLR_LENGTH                       equ 0001h
PORTG_nMCLR_MASK                         equ 0020h
PORTG_SEG42_POSN                         equ 0000h
PORTG_SEG42_POSITION                     equ 0000h
PORTG_SEG42_SIZE                         equ 0001h
PORTG_SEG42_LENGTH                       equ 0001h
PORTG_SEG42_MASK                         equ 0001h
PORTG_SEG43_POSN                         equ 0001h
PORTG_SEG43_POSITION                     equ 0001h
PORTG_SEG43_SIZE                         equ 0001h
PORTG_SEG43_LENGTH                       equ 0001h
PORTG_SEG43_MASK                         equ 0002h
PORTG_SEG44_POSN                         equ 0002h
PORTG_SEG44_POSITION                     equ 0002h
PORTG_SEG44_SIZE                         equ 0001h
PORTG_SEG44_LENGTH                       equ 0001h
PORTG_SEG44_MASK                         equ 0004h
PORTG_SEG45_POSN                         equ 0003h
PORTG_SEG45_POSITION                     equ 0003h
PORTG_SEG45_SIZE                         equ 0001h
PORTG_SEG45_LENGTH                       equ 0001h
PORTG_SEG45_MASK                         equ 0008h
PORTG_SEG26_POSN                         equ 0004h
PORTG_SEG26_POSITION                     equ 0004h
PORTG_SEG26_SIZE                         equ 0001h
PORTG_SEG26_LENGTH                       equ 0001h
PORTG_SEG26_MASK                         equ 0010h
PORTG_CPS15_POSN                         equ 0001h
PORTG_CPS15_POSITION                     equ 0001h
PORTG_CPS15_SIZE                         equ 0001h
PORTG_CPS15_LENGTH                       equ 0001h
PORTG_CPS15_MASK                         equ 0002h
PORTG_CPS14_POSN                         equ 0002h
PORTG_CPS14_POSITION                     equ 0002h
PORTG_CPS14_SIZE                         equ 0001h
PORTG_CPS14_LENGTH                       equ 0001h
PORTG_CPS14_MASK                         equ 0004h
PORTG_CPS13_POSN                         equ 0003h
PORTG_CPS13_POSITION                     equ 0003h
PORTG_CPS13_SIZE                         equ 0001h
PORTG_CPS13_LENGTH                       equ 0001h
PORTG_CPS13_MASK                         equ 0008h
PORTG_CPS12_POSN                         equ 0004h
PORTG_CPS12_POSITION                     equ 0004h
PORTG_CPS12_SIZE                         equ 0001h
PORTG_CPS12_LENGTH                       equ 0001h
PORTG_CPS12_MASK                         equ 0010h
PORTG_C3OUT_POSN                         equ 0001h
PORTG_C3OUT_POSITION                     equ 0001h
PORTG_C3OUT_SIZE                         equ 0001h
PORTG_C3OUT_LENGTH                       equ 0001h
PORTG_C3OUT_MASK                         equ 0002h
PORTG_C3INP_POSN                         equ 0002h
PORTG_C3INP_POSITION                     equ 0002h
PORTG_C3INP_SIZE                         equ 0001h
PORTG_C3INP_LENGTH                       equ 0001h
PORTG_C3INP_MASK                         equ 0004h
PORTG_C3IN0N_POSN                        equ 0003h
PORTG_C3IN0N_POSITION                    equ 0003h
PORTG_C3IN0N_SIZE                        equ 0001h
PORTG_C3IN0N_LENGTH                      equ 0001h
PORTG_C3IN0N_MASK                        equ 0008h
PORTG_C3IN1N_POSN                        equ 0004h
PORTG_C3IN1N_POSITION                    equ 0004h
PORTG_C3IN1N_SIZE                        equ 0001h
PORTG_C3IN1N_LENGTH                      equ 0001h
PORTG_C3IN1N_MASK                        equ 0010h
PORTG_CCP3_POSN                          equ 0000h
PORTG_CCP3_POSITION                      equ 0000h
PORTG_CCP3_SIZE                          equ 0001h
PORTG_CCP3_LENGTH                        equ 0001h
PORTG_CCP3_MASK                          equ 0001h
PORTG_TX2_POSN                           equ 0001h
PORTG_TX2_POSITION                       equ 0001h
PORTG_TX2_SIZE                           equ 0001h
PORTG_TX2_LENGTH                         equ 0001h
PORTG_TX2_MASK                           equ 0002h
PORTG_RX2_POSN                           equ 0002h
PORTG_RX2_POSITION                       equ 0002h
PORTG_RX2_SIZE                           equ 0001h
PORTG_RX2_LENGTH                         equ 0001h
PORTG_RX2_MASK                           equ 0004h
PORTG_CCP4_POSN                          equ 0003h
PORTG_CCP4_POSITION                      equ 0003h
PORTG_CCP4_SIZE                          equ 0001h
PORTG_CCP4_LENGTH                        equ 0001h
PORTG_CCP4_MASK                          equ 0008h
PORTG_CCP5_POSN                          equ 0004h
PORTG_CCP5_POSITION                      equ 0004h
PORTG_CCP5_SIZE                          equ 0001h
PORTG_CCP5_LENGTH                        equ 0001h
PORTG_CCP5_MASK                          equ 0010h
PORTG_P3A_POSN                           equ 0000h
PORTG_P3A_POSITION                       equ 0000h
PORTG_P3A_SIZE                           equ 0001h
PORTG_P3A_LENGTH                         equ 0001h
PORTG_P3A_MASK                           equ 0001h
PORTG_CK2_POSN                           equ 0001h
PORTG_CK2_POSITION                       equ 0001h
PORTG_CK2_SIZE                           equ 0001h
PORTG_CK2_LENGTH                         equ 0001h
PORTG_CK2_MASK                           equ 0002h
PORTG_DT2_POSN                           equ 0002h
PORTG_DT2_POSITION                       equ 0002h
PORTG_DT2_SIZE                           equ 0001h
PORTG_DT2_LENGTH                         equ 0001h
PORTG_DT2_MASK                           equ 0004h
PORTG_P3D_POSN                           equ 0003h
PORTG_P3D_POSITION                       equ 0003h
PORTG_P3D_SIZE                           equ 0001h
PORTG_P3D_LENGTH                         equ 0001h
PORTG_P3D_MASK                           equ 0008h
PORTG_P1D_POSN                           equ 0004h
PORTG_P1D_POSITION                       equ 0004h
PORTG_P1D_SIZE                           equ 0001h
PORTG_P1D_LENGTH                         equ 0001h
PORTG_P1D_MASK                           equ 0010h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0291h
// bitfield definitions
CCPR1L_CCPR1L_POSN                       equ 0000h
CCPR1L_CCPR1L_POSITION                   equ 0000h
CCPR1L_CCPR1L_SIZE                       equ 0008h
CCPR1L_CCPR1L_LENGTH                     equ 0008h
CCPR1L_CCPR1L_MASK                       equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0292h
// bitfield definitions
CCPR1H_CCPR1H_POSN                       equ 0000h
CCPR1H_CCPR1H_POSITION                   equ 0000h
CCPR1H_CCPR1H_SIZE                       equ 0008h
CCPR1H_CCPR1H_LENGTH                     equ 0008h
CCPR1H_CCPR1H_MASK                       equ 00FFh

