GopalSaraf/Practicals/PSDL/include/proc/pic16lf1947.inc
// Register: LCDDATA4
#define LCDDATA4 LCDDATA4
LCDDATA4                                 equ 07A4h
// bitfield definitions
LCDDATA4_SEG8COM1_POSN                   equ 0000h
LCDDATA4_SEG8COM1_POSITION               equ 0000h
LCDDATA4_SEG8COM1_SIZE                   equ 0001h
LCDDATA4_SEG8COM1_LENGTH                 equ 0001h
LCDDATA4_SEG8COM1_MASK                   equ 0001h
LCDDATA4_SEG9COM1_POSN                   equ 0001h
LCDDATA4_SEG9COM1_POSITION               equ 0001h
LCDDATA4_SEG9COM1_SIZE                   equ 0001h
LCDDATA4_SEG9COM1_LENGTH                 equ 0001h
LCDDATA4_SEG9COM1_MASK                   equ 0002h
LCDDATA4_SEG10COM1_POSN                  equ 0002h
LCDDATA4_SEG10COM1_POSITION              equ 0002h
LCDDATA4_SEG10COM1_SIZE                  equ 0001h
LCDDATA4_SEG10COM1_LENGTH                equ 0001h
LCDDATA4_SEG10COM1_MASK                  equ 0004h
LCDDATA4_SEG11COM1_POSN                  equ 0003h
LCDDATA4_SEG11COM1_POSITION              equ 0003h
LCDDATA4_SEG11COM1_SIZE                  equ 0001h
LCDDATA4_SEG11COM1_LENGTH                equ 0001h
LCDDATA4_SEG11COM1_MASK                  equ 0008h
LCDDATA4_SEG12COM1_POSN                  equ 0004h
LCDDATA4_SEG12COM1_POSITION              equ 0004h
LCDDATA4_SEG12COM1_SIZE                  equ 0001h
LCDDATA4_SEG12COM1_LENGTH                equ 0001h
LCDDATA4_SEG12COM1_MASK                  equ 0010h
LCDDATA4_SEG13COM1_POSN                  equ 0005h
LCDDATA4_SEG13COM1_POSITION              equ 0005h
LCDDATA4_SEG13COM1_SIZE                  equ 0001h
LCDDATA4_SEG13COM1_LENGTH                equ 0001h
LCDDATA4_SEG13COM1_MASK                  equ 0020h
LCDDATA4_SEG14COM1_POSN                  equ 0006h
LCDDATA4_SEG14COM1_POSITION              equ 0006h
LCDDATA4_SEG14COM1_SIZE                  equ 0001h
LCDDATA4_SEG14COM1_LENGTH                equ 0001h
LCDDATA4_SEG14COM1_MASK                  equ 0040h
LCDDATA4_SEG15COM1_POSN                  equ 0007h
LCDDATA4_SEG15COM1_POSITION              equ 0007h
LCDDATA4_SEG15COM1_SIZE                  equ 0001h
LCDDATA4_SEG15COM1_LENGTH                equ 0001h
LCDDATA4_SEG15COM1_MASK                  equ 0080h

// Register: LCDDATA5
#define LCDDATA5 LCDDATA5
LCDDATA5                                 equ 07A5h
// bitfield definitions
LCDDATA5_SEG16COM1_POSN                  equ 0000h
LCDDATA5_SEG16COM1_POSITION              equ 0000h
LCDDATA5_SEG16COM1_SIZE                  equ 0001h
LCDDATA5_SEG16COM1_LENGTH                equ 0001h
LCDDATA5_SEG16COM1_MASK                  equ 0001h
LCDDATA5_SEG17COM1_POSN                  equ 0001h
LCDDATA5_SEG17COM1_POSITION              equ 0001h
LCDDATA5_SEG17COM1_SIZE                  equ 0001h
LCDDATA5_SEG17COM1_LENGTH                equ 0001h
LCDDATA5_SEG17COM1_MASK                  equ 0002h
LCDDATA5_SEG18COM1_POSN                  equ 0002h
LCDDATA5_SEG18COM1_POSITION              equ 0002h
LCDDATA5_SEG18COM1_SIZE                  equ 0001h
LCDDATA5_SEG18COM1_LENGTH                equ 0001h
LCDDATA5_SEG18COM1_MASK                  equ 0004h
LCDDATA5_SEG19COM1_POSN                  equ 0003h
LCDDATA5_SEG19COM1_POSITION              equ 0003h
LCDDATA5_SEG19COM1_SIZE                  equ 0001h
LCDDATA5_SEG19COM1_LENGTH                equ 0001h
LCDDATA5_SEG19COM1_MASK                  equ 0008h
LCDDATA5_SEG20COM1_POSN                  equ 0004h
LCDDATA5_SEG20COM1_POSITION              equ 0004h
LCDDATA5_SEG20COM1_SIZE                  equ 0001h
LCDDATA5_SEG20COM1_LENGTH                equ 0001h
LCDDATA5_SEG20COM1_MASK                  equ 0010h
LCDDATA5_SEG21COM1_POSN                  equ 0005h
LCDDATA5_SEG21COM1_POSITION              equ 0005h
LCDDATA5_SEG21COM1_SIZE                  equ 0001h
LCDDATA5_SEG21COM1_LENGTH                equ 0001h
LCDDATA5_SEG21COM1_MASK                  equ 0020h
LCDDATA5_SEG22COM1_POSN                  equ 0006h
LCDDATA5_SEG22COM1_POSITION              equ 0006h
LCDDATA5_SEG22COM1_SIZE                  equ 0001h
LCDDATA5_SEG22COM1_LENGTH                equ 0001h
LCDDATA5_SEG22COM1_MASK                  equ 0040h
LCDDATA5_SEG23COM1_POSN                  equ 0007h
LCDDATA5_SEG23COM1_POSITION              equ 0007h
LCDDATA5_SEG23COM1_SIZE                  equ 0001h
LCDDATA5_SEG23COM1_LENGTH                equ 0001h
LCDDATA5_SEG23COM1_MASK                  equ 0080h

// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 07A6h
// bitfield definitions
LCDDATA6_SEG0COM2_POSN                   equ 0000h
LCDDATA6_SEG0COM2_POSITION               equ 0000h
LCDDATA6_SEG0COM2_SIZE                   equ 0001h
LCDDATA6_SEG0COM2_LENGTH                 equ 0001h
LCDDATA6_SEG0COM2_MASK                   equ 0001h
LCDDATA6_SEG1COM2_POSN                   equ 0001h
LCDDATA6_SEG1COM2_POSITION               equ 0001h
LCDDATA6_SEG1COM2_SIZE                   equ 0001h
LCDDATA6_SEG1COM2_LENGTH                 equ 0001h
LCDDATA6_SEG1COM2_MASK                   equ 0002h
LCDDATA6_SEG2COM2_POSN                   equ 0002h
LCDDATA6_SEG2COM2_POSITION               equ 0002h
LCDDATA6_SEG2COM2_SIZE                   equ 0001h
LCDDATA6_SEG2COM2_LENGTH                 equ 0001h
LCDDATA6_SEG2COM2_MASK                   equ 0004h
LCDDATA6_SEG3COM2_POSN                   equ 0003h
LCDDATA6_SEG3COM2_POSITION               equ 0003h
LCDDATA6_SEG3COM2_SIZE                   equ 0001h
LCDDATA6_SEG3COM2_LENGTH                 equ 0001h
LCDDATA6_SEG3COM2_MASK                   equ 0008h
LCDDATA6_SEG4COM2_POSN                   equ 0004h
LCDDATA6_SEG4COM2_POSITION               equ 0004h
LCDDATA6_SEG4COM2_SIZE                   equ 0001h
LCDDATA6_SEG4COM2_LENGTH                 equ 0001h
LCDDATA6_SEG4COM2_MASK                   equ 0010h
LCDDATA6_SEG5COM2_POSN                   equ 0005h
LCDDATA6_SEG5COM2_POSITION               equ 0005h
LCDDATA6_SEG5COM2_SIZE                   equ 0001h
LCDDATA6_SEG5COM2_LENGTH                 equ 0001h
LCDDATA6_SEG5COM2_MASK                   equ 0020h
LCDDATA6_SEG6COM2_POSN                   equ 0006h
LCDDATA6_SEG6COM2_POSITION               equ 0006h
LCDDATA6_SEG6COM2_SIZE                   equ 0001h
LCDDATA6_SEG6COM2_LENGTH                 equ 0001h
LCDDATA6_SEG6COM2_MASK                   equ 0040h
LCDDATA6_SEG7COM2_POSN                   equ 0007h
LCDDATA6_SEG7COM2_POSITION               equ 0007h
LCDDATA6_SEG7COM2_SIZE                   equ 0001h
LCDDATA6_SEG7COM2_LENGTH                 equ 0001h
LCDDATA6_SEG7COM2_MASK                   equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 07A7h
// bitfield definitions
LCDDATA7_SEG8COM2_POSN                   equ 0000h
LCDDATA7_SEG8COM2_POSITION               equ 0000h
LCDDATA7_SEG8COM2_SIZE                   equ 0001h
LCDDATA7_SEG8COM2_LENGTH                 equ 0001h
LCDDATA7_SEG8COM2_MASK                   equ 0001h
LCDDATA7_SEG9COM2_POSN                   equ 0001h
LCDDATA7_SEG9COM2_POSITION               equ 0001h
LCDDATA7_SEG9COM2_SIZE                   equ 0001h
LCDDATA7_SEG9COM2_LENGTH                 equ 0001h
LCDDATA7_SEG9COM2_MASK                   equ 0002h
LCDDATA7_SEG10COM2_POSN                  equ 0002h
LCDDATA7_SEG10COM2_POSITION              equ 0002h
LCDDATA7_SEG10COM2_SIZE                  equ 0001h
LCDDATA7_SEG10COM2_LENGTH                equ 0001h
LCDDATA7_SEG10COM2_MASK                  equ 0004h
LCDDATA7_SEG11COM2_POSN                  equ 0003h
LCDDATA7_SEG11COM2_POSITION              equ 0003h
LCDDATA7_SEG11COM2_SIZE                  equ 0001h
LCDDATA7_SEG11COM2_LENGTH                equ 0001h
LCDDATA7_SEG11COM2_MASK                  equ 0008h
LCDDATA7_SEG12COM2_POSN                  equ 0004h
LCDDATA7_SEG12COM2_POSITION              equ 0004h
LCDDATA7_SEG12COM2_SIZE                  equ 0001h
LCDDATA7_SEG12COM2_LENGTH                equ 0001h
LCDDATA7_SEG12COM2_MASK                  equ 0010h
LCDDATA7_SEG13COM2_POSN                  equ 0005h
LCDDATA7_SEG13COM2_POSITION              equ 0005h
LCDDATA7_SEG13COM2_SIZE                  equ 0001h
LCDDATA7_SEG13COM2_LENGTH                equ 0001h
LCDDATA7_SEG13COM2_MASK                  equ 0020h
LCDDATA7_SEG14COM2_POSN                  equ 0006h
LCDDATA7_SEG14COM2_POSITION              equ 0006h
LCDDATA7_SEG14COM2_SIZE                  equ 0001h
LCDDATA7_SEG14COM2_LENGTH                equ 0001h
LCDDATA7_SEG14COM2_MASK                  equ 0040h
LCDDATA7_SEG15COM2_POSN                  equ 0007h
LCDDATA7_SEG15COM2_POSITION              equ 0007h
LCDDATA7_SEG15COM2_SIZE                  equ 0001h
LCDDATA7_SEG15COM2_LENGTH                equ 0001h
LCDDATA7_SEG15COM2_MASK                  equ 0080h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 07A8h
// bitfield definitions
LCDDATA8_SEG16COM2_POSN                  equ 0000h
LCDDATA8_SEG16COM2_POSITION              equ 0000h
LCDDATA8_SEG16COM2_SIZE                  equ 0001h
LCDDATA8_SEG16COM2_LENGTH                equ 0001h
LCDDATA8_SEG16COM2_MASK                  equ 0001h
LCDDATA8_SEG17COM2_POSN                  equ 0001h
LCDDATA8_SEG17COM2_POSITION              equ 0001h
LCDDATA8_SEG17COM2_SIZE                  equ 0001h
LCDDATA8_SEG17COM2_LENGTH                equ 0001h
LCDDATA8_SEG17COM2_MASK                  equ 0002h
LCDDATA8_SEG18COM2_POSN                  equ 0002h
LCDDATA8_SEG18COM2_POSITION              equ 0002h
LCDDATA8_SEG18COM2_SIZE                  equ 0001h
LCDDATA8_SEG18COM2_LENGTH                equ 0001h
LCDDATA8_SEG18COM2_MASK                  equ 0004h
LCDDATA8_SEG19COM2_POSN                  equ 0003h
LCDDATA8_SEG19COM2_POSITION              equ 0003h
LCDDATA8_SEG19COM2_SIZE                  equ 0001h
LCDDATA8_SEG19COM2_LENGTH                equ 0001h
LCDDATA8_SEG19COM2_MASK                  equ 0008h
LCDDATA8_SEG20COM2_POSN                  equ 0004h
LCDDATA8_SEG20COM2_POSITION              equ 0004h
LCDDATA8_SEG20COM2_SIZE                  equ 0001h
LCDDATA8_SEG20COM2_LENGTH                equ 0001h
LCDDATA8_SEG20COM2_MASK                  equ 0010h
LCDDATA8_SEG21COM2_POSN                  equ 0005h
LCDDATA8_SEG21COM2_POSITION              equ 0005h
LCDDATA8_SEG21COM2_SIZE                  equ 0001h
LCDDATA8_SEG21COM2_LENGTH                equ 0001h
LCDDATA8_SEG21COM2_MASK                  equ 0020h
LCDDATA8_SEG22COM2_POSN                  equ 0006h
LCDDATA8_SEG22COM2_POSITION              equ 0006h
LCDDATA8_SEG22COM2_SIZE                  equ 0001h
LCDDATA8_SEG22COM2_LENGTH                equ 0001h
LCDDATA8_SEG22COM2_MASK                  equ 0040h
LCDDATA8_SEG23COM2_POSN                  equ 0007h
LCDDATA8_SEG23COM2_POSITION              equ 0007h
LCDDATA8_SEG23COM2_SIZE                  equ 0001h
LCDDATA8_SEG23COM2_LENGTH                equ 0001h
LCDDATA8_SEG23COM2_MASK                  equ 0080h

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 07A9h
// bitfield definitions
LCDDATA9_SEG0COM3_POSN                   equ 0000h
LCDDATA9_SEG0COM3_POSITION               equ 0000h
LCDDATA9_SEG0COM3_SIZE                   equ 0001h
LCDDATA9_SEG0COM3_LENGTH                 equ 0001h
LCDDATA9_SEG0COM3_MASK                   equ 0001h
LCDDATA9_SEG1COM3_POSN                   equ 0001h
LCDDATA9_SEG1COM3_POSITION               equ 0001h
LCDDATA9_SEG1COM3_SIZE                   equ 0001h
LCDDATA9_SEG1COM3_LENGTH                 equ 0001h
LCDDATA9_SEG1COM3_MASK                   equ 0002h
LCDDATA9_SEG2COM3_POSN                   equ 0002h
LCDDATA9_SEG2COM3_POSITION               equ 0002h
LCDDATA9_SEG2COM3_SIZE                   equ 0001h
LCDDATA9_SEG2COM3_LENGTH                 equ 0001h
LCDDATA9_SEG2COM3_MASK                   equ 0004h
LCDDATA9_SEG3COM3_POSN                   equ 0003h
LCDDATA9_SEG3COM3_POSITION               equ 0003h
LCDDATA9_SEG3COM3_SIZE                   equ 0001h
LCDDATA9_SEG3COM3_LENGTH                 equ 0001h
LCDDATA9_SEG3COM3_MASK                   equ 0008h
LCDDATA9_SEG4COM3_POSN                   equ 0004h
LCDDATA9_SEG4COM3_POSITION               equ 0004h
LCDDATA9_SEG4COM3_SIZE                   equ 0001h
LCDDATA9_SEG4COM3_LENGTH                 equ 0001h
LCDDATA9_SEG4COM3_MASK                   equ 0010h
LCDDATA9_SEG5COM3_POSN                   equ 0005h
LCDDATA9_SEG5COM3_POSITION               equ 0005h
LCDDATA9_SEG5COM3_SIZE                   equ 0001h
LCDDATA9_SEG5COM3_LENGTH                 equ 0001h
LCDDATA9_SEG5COM3_MASK                   equ 0020h
LCDDATA9_SEG6COM3_POSN                   equ 0006h
LCDDATA9_SEG6COM3_POSITION               equ 0006h
LCDDATA9_SEG6COM3_SIZE                   equ 0001h
LCDDATA9_SEG6COM3_LENGTH                 equ 0001h
LCDDATA9_SEG6COM3_MASK                   equ 0040h
LCDDATA9_SEG7COM3_POSN                   equ 0007h
LCDDATA9_SEG7COM3_POSITION               equ 0007h
LCDDATA9_SEG7COM3_SIZE                   equ 0001h
LCDDATA9_SEG7COM3_LENGTH                 equ 0001h
LCDDATA9_SEG7COM3_MASK                   equ 0080h

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 07AAh
// bitfield definitions
LCDDATA10_SEG8COM3_POSN                  equ 0000h
LCDDATA10_SEG8COM3_POSITION              equ 0000h
LCDDATA10_SEG8COM3_SIZE                  equ 0001h
LCDDATA10_SEG8COM3_LENGTH                equ 0001h
LCDDATA10_SEG8COM3_MASK                  equ 0001h
LCDDATA10_SEG9COM3_POSN                  equ 0001h
LCDDATA10_SEG9COM3_POSITION              equ 0001h
LCDDATA10_SEG9COM3_SIZE                  equ 0001h
LCDDATA10_SEG9COM3_LENGTH                equ 0001h
LCDDATA10_SEG9COM3_MASK                  equ 0002h
LCDDATA10_SEG10COM3_POSN                 equ 0002h
LCDDATA10_SEG10COM3_POSITION             equ 0002h
LCDDATA10_SEG10COM3_SIZE                 equ 0001h
LCDDATA10_SEG10COM3_LENGTH               equ 0001h
LCDDATA10_SEG10COM3_MASK                 equ 0004h
LCDDATA10_SEG11COM3_POSN                 equ 0003h
LCDDATA10_SEG11COM3_POSITION             equ 0003h
LCDDATA10_SEG11COM3_SIZE                 equ 0001h
LCDDATA10_SEG11COM3_LENGTH               equ 0001h
LCDDATA10_SEG11COM3_MASK                 equ 0008h
LCDDATA10_SEG12COM3_POSN                 equ 0004h
LCDDATA10_SEG12COM3_POSITION             equ 0004h
LCDDATA10_SEG12COM3_SIZE                 equ 0001h
LCDDATA10_SEG12COM3_LENGTH               equ 0001h
LCDDATA10_SEG12COM3_MASK                 equ 0010h
LCDDATA10_SEG13COM3_POSN                 equ 0005h
LCDDATA10_SEG13COM3_POSITION             equ 0005h
LCDDATA10_SEG13COM3_SIZE                 equ 0001h
LCDDATA10_SEG13COM3_LENGTH               equ 0001h
LCDDATA10_SEG13COM3_MASK                 equ 0020h
LCDDATA10_SEG14COM3_POSN                 equ 0006h
LCDDATA10_SEG14COM3_POSITION             equ 0006h
LCDDATA10_SEG14COM3_SIZE                 equ 0001h
LCDDATA10_SEG14COM3_LENGTH               equ 0001h
LCDDATA10_SEG14COM3_MASK                 equ 0040h
LCDDATA10_SEG15COM3_POSN                 equ 0007h
LCDDATA10_SEG15COM3_POSITION             equ 0007h
LCDDATA10_SEG15COM3_SIZE                 equ 0001h
LCDDATA10_SEG15COM3_LENGTH               equ 0001h
LCDDATA10_SEG15COM3_MASK                 equ 0080h

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
LCDDATA11                                equ 07ABh
// bitfield definitions
LCDDATA11_SEG16COM3_POSN                 equ 0000h
LCDDATA11_SEG16COM3_POSITION             equ 0000h
LCDDATA11_SEG16COM3_SIZE                 equ 0001h
LCDDATA11_SEG16COM3_LENGTH               equ 0001h
LCDDATA11_SEG16COM3_MASK                 equ 0001h
LCDDATA11_SEG17COM3_POSN                 equ 0001h
LCDDATA11_SEG17COM3_POSITION             equ 0001h
LCDDATA11_SEG17COM3_SIZE                 equ 0001h
LCDDATA11_SEG17COM3_LENGTH               equ 0001h
LCDDATA11_SEG17COM3_MASK                 equ 0002h
LCDDATA11_SEG18COM3_POSN                 equ 0002h
LCDDATA11_SEG18COM3_POSITION             equ 0002h
LCDDATA11_SEG18COM3_SIZE                 equ 0001h
LCDDATA11_SEG18COM3_LENGTH               equ 0001h
LCDDATA11_SEG18COM3_MASK                 equ 0004h
LCDDATA11_SEG19COM3_POSN                 equ 0003h
LCDDATA11_SEG19COM3_POSITION             equ 0003h
LCDDATA11_SEG19COM3_SIZE                 equ 0001h
LCDDATA11_SEG19COM3_LENGTH               equ 0001h
LCDDATA11_SEG19COM3_MASK                 equ 0008h
LCDDATA11_SEG20COM3_POSN                 equ 0004h
LCDDATA11_SEG20COM3_POSITION             equ 0004h
LCDDATA11_SEG20COM3_SIZE                 equ 0001h
LCDDATA11_SEG20COM3_LENGTH               equ 0001h
LCDDATA11_SEG20COM3_MASK                 equ 0010h
LCDDATA11_SEG21COM3_POSN                 equ 0005h
LCDDATA11_SEG21COM3_POSITION             equ 0005h
LCDDATA11_SEG21COM3_SIZE                 equ 0001h
LCDDATA11_SEG21COM3_LENGTH               equ 0001h
LCDDATA11_SEG21COM3_MASK                 equ 0020h
LCDDATA11_SEG22COM3_POSN                 equ 0006h
LCDDATA11_SEG22COM3_POSITION             equ 0006h
LCDDATA11_SEG22COM3_SIZE                 equ 0001h
LCDDATA11_SEG22COM3_LENGTH               equ 0001h
LCDDATA11_SEG22COM3_MASK                 equ 0040h
LCDDATA11_SEG23COM3_POSN                 equ 0007h
LCDDATA11_SEG23COM3_POSITION             equ 0007h
LCDDATA11_SEG23COM3_SIZE                 equ 0001h
LCDDATA11_SEG23COM3_LENGTH               equ 0001h
LCDDATA11_SEG23COM3_MASK                 equ 0080h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 07ACh
// bitfield definitions
LCDDATA12_SEG24COM0_POSN                 equ 0000h
LCDDATA12_SEG24COM0_POSITION             equ 0000h
LCDDATA12_SEG24COM0_SIZE                 equ 0001h
LCDDATA12_SEG24COM0_LENGTH               equ 0001h
LCDDATA12_SEG24COM0_MASK                 equ 0001h
LCDDATA12_SEG25COM0_POSN                 equ 0001h
LCDDATA12_SEG25COM0_POSITION             equ 0001h
LCDDATA12_SEG25COM0_SIZE                 equ 0001h
LCDDATA12_SEG25COM0_LENGTH               equ 0001h
LCDDATA12_SEG25COM0_MASK                 equ 0002h
LCDDATA12_SEG26COM0_POSN                 equ 0002h
LCDDATA12_SEG26COM0_POSITION             equ 0002h
LCDDATA12_SEG26COM0_SIZE                 equ 0001h
LCDDATA12_SEG26COM0_LENGTH               equ 0001h
LCDDATA12_SEG26COM0_MASK                 equ 0004h
LCDDATA12_SEG27COM0_POSN                 equ 0003h
LCDDATA12_SEG27COM0_POSITION             equ 0003h
LCDDATA12_SEG27COM0_SIZE                 equ 0001h
LCDDATA12_SEG27COM0_LENGTH               equ 0001h
LCDDATA12_SEG27COM0_MASK                 equ 0008h
LCDDATA12_SEG28COM0_POSN                 equ 0004h
LCDDATA12_SEG28COM0_POSITION             equ 0004h
LCDDATA12_SEG28COM0_SIZE                 equ 0001h
LCDDATA12_SEG28COM0_LENGTH               equ 0001h
LCDDATA12_SEG28COM0_MASK                 equ 0010h
LCDDATA12_SEG29COM0_POSN                 equ 0005h
LCDDATA12_SEG29COM0_POSITION             equ 0005h
LCDDATA12_SEG29COM0_SIZE                 equ 0001h
LCDDATA12_SEG29COM0_LENGTH               equ 0001h
LCDDATA12_SEG29COM0_MASK                 equ 0020h
LCDDATA12_SEG30COM0_POSN                 equ 0006h
LCDDATA12_SEG30COM0_POSITION             equ 0006h
LCDDATA12_SEG30COM0_SIZE                 equ 0001h
LCDDATA12_SEG30COM0_LENGTH               equ 0001h
LCDDATA12_SEG30COM0_MASK                 equ 0040h
LCDDATA12_SEG31COM0_POSN                 equ 0007h
LCDDATA12_SEG31COM0_POSITION             equ 0007h
LCDDATA12_SEG31COM0_SIZE                 equ 0001h
LCDDATA12_SEG31COM0_LENGTH               equ 0001h
LCDDATA12_SEG31COM0_MASK                 equ 0080h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 07ADh
// bitfield definitions
LCDDATA13_SEG32COM0_POSN                 equ 0000h
LCDDATA13_SEG32COM0_POSITION             equ 0000h
LCDDATA13_SEG32COM0_SIZE                 equ 0001h
LCDDATA13_SEG32COM0_LENGTH               equ 0001h
LCDDATA13_SEG32COM0_MASK                 equ 0001h
LCDDATA13_SEG33COM0_POSN                 equ 0001h
LCDDATA13_SEG33COM0_POSITION             equ 0001h
LCDDATA13_SEG33COM0_SIZE                 equ 0001h
LCDDATA13_SEG33COM0_LENGTH               equ 0001h
LCDDATA13_SEG33COM0_MASK                 equ 0002h
LCDDATA13_SEG34COM0_POSN                 equ 0002h
LCDDATA13_SEG34COM0_POSITION             equ 0002h
LCDDATA13_SEG34COM0_SIZE                 equ 0001h
LCDDATA13_SEG34COM0_LENGTH               equ 0001h
LCDDATA13_SEG34COM0_MASK                 equ 0004h
LCDDATA13_SEG35COM0_POSN                 equ 0003h
LCDDATA13_SEG35COM0_POSITION             equ 0003h
LCDDATA13_SEG35COM0_SIZE                 equ 0001h
LCDDATA13_SEG35COM0_LENGTH               equ 0001h
LCDDATA13_SEG35COM0_MASK                 equ 0008h
LCDDATA13_SEG36COM0_POSN                 equ 0004h
LCDDATA13_SEG36COM0_POSITION             equ 0004h
LCDDATA13_SEG36COM0_SIZE                 equ 0001h
LCDDATA13_SEG36COM0_LENGTH               equ 0001h
LCDDATA13_SEG36COM0_MASK                 equ 0010h
LCDDATA13_SEG37COM0_POSN                 equ 0005h
LCDDATA13_SEG37COM0_POSITION             equ 0005h
LCDDATA13_SEG37COM0_SIZE                 equ 0001h
LCDDATA13_SEG37COM0_LENGTH               equ 0001h
LCDDATA13_SEG37COM0_MASK                 equ 0020h
LCDDATA13_SEG38COM0_POSN                 equ 0006h
LCDDATA13_SEG38COM0_POSITION             equ 0006h
LCDDATA13_SEG38COM0_SIZE                 equ 0001h
LCDDATA13_SEG38COM0_LENGTH               equ 0001h
LCDDATA13_SEG38COM0_MASK                 equ 0040h
LCDDATA13_SEG39COM0_POSN                 equ 0007h
LCDDATA13_SEG39COM0_POSITION             equ 0007h
LCDDATA13_SEG39COM0_SIZE                 equ 0001h
LCDDATA13_SEG39COM0_LENGTH               equ 0001h
LCDDATA13_SEG39COM0_MASK                 equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 07AEh
// bitfield definitions
LCDDATA14_SEG40COM0_POSN                 equ 0000h
LCDDATA14_SEG40COM0_POSITION             equ 0000h
LCDDATA14_SEG40COM0_SIZE                 equ 0001h
LCDDATA14_SEG40COM0_LENGTH               equ 0001h
LCDDATA14_SEG40COM0_MASK                 equ 0001h
LCDDATA14_SEG41COM0_POSN                 equ 0001h
LCDDATA14_SEG41COM0_POSITION             equ 0001h
LCDDATA14_SEG41COM0_SIZE                 equ 0001h
LCDDATA14_SEG41COM0_LENGTH               equ 0001h
LCDDATA14_SEG41COM0_MASK                 equ 0002h
LCDDATA14_SEG42COM0_POSN                 equ 0002h
LCDDATA14_SEG42COM0_POSITION             equ 0002h
LCDDATA14_SEG42COM0_SIZE                 equ 0001h
LCDDATA14_SEG42COM0_LENGTH               equ 0001h
LCDDATA14_SEG42COM0_MASK                 equ 0004h
LCDDATA14_SEG43COM0_POSN                 equ 0003h
LCDDATA14_SEG43COM0_POSITION             equ 0003h
LCDDATA14_SEG43COM0_SIZE                 equ 0001h
LCDDATA14_SEG43COM0_LENGTH               equ 0001h
LCDDATA14_SEG43COM0_MASK                 equ 0008h
LCDDATA14_SEG44COM0_POSN                 equ 0004h
LCDDATA14_SEG44COM0_POSITION             equ 0004h
LCDDATA14_SEG44COM0_SIZE                 equ 0001h
LCDDATA14_SEG44COM0_LENGTH               equ 0001h
LCDDATA14_SEG44COM0_MASK                 equ 0010h
LCDDATA14_SEG45COM0_POSN                 equ 0005h
LCDDATA14_SEG45COM0_POSITION             equ 0005h
LCDDATA14_SEG45COM0_SIZE                 equ 0001h
LCDDATA14_SEG45COM0_LENGTH               equ 0001h
LCDDATA14_SEG45COM0_MASK                 equ 0020h

