GopalSaraf/Practicals/PSDL/include/proc/pic16lf1947.inc
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
LCDDATA15                                equ 07AFh
// bitfield definitions
LCDDATA15_SEG24COM1_POSN                 equ 0000h
LCDDATA15_SEG24COM1_POSITION             equ 0000h
LCDDATA15_SEG24COM1_SIZE                 equ 0001h
LCDDATA15_SEG24COM1_LENGTH               equ 0001h
LCDDATA15_SEG24COM1_MASK                 equ 0001h
LCDDATA15_SEG25COM1_POSN                 equ 0001h
LCDDATA15_SEG25COM1_POSITION             equ 0001h
LCDDATA15_SEG25COM1_SIZE                 equ 0001h
LCDDATA15_SEG25COM1_LENGTH               equ 0001h
LCDDATA15_SEG25COM1_MASK                 equ 0002h
LCDDATA15_SEG26COM1_POSN                 equ 0002h
LCDDATA15_SEG26COM1_POSITION             equ 0002h
LCDDATA15_SEG26COM1_SIZE                 equ 0001h
LCDDATA15_SEG26COM1_LENGTH               equ 0001h
LCDDATA15_SEG26COM1_MASK                 equ 0004h
LCDDATA15_SEG27COM1_POSN                 equ 0003h
LCDDATA15_SEG27COM1_POSITION             equ 0003h
LCDDATA15_SEG27COM1_SIZE                 equ 0001h
LCDDATA15_SEG27COM1_LENGTH               equ 0001h
LCDDATA15_SEG27COM1_MASK                 equ 0008h
LCDDATA15_SEG28COM1_POSN                 equ 0004h
LCDDATA15_SEG28COM1_POSITION             equ 0004h
LCDDATA15_SEG28COM1_SIZE                 equ 0001h
LCDDATA15_SEG28COM1_LENGTH               equ 0001h
LCDDATA15_SEG28COM1_MASK                 equ 0010h
LCDDATA15_SEG29COM1_POSN                 equ 0005h
LCDDATA15_SEG29COM1_POSITION             equ 0005h
LCDDATA15_SEG29COM1_SIZE                 equ 0001h
LCDDATA15_SEG29COM1_LENGTH               equ 0001h
LCDDATA15_SEG29COM1_MASK                 equ 0020h
LCDDATA15_SEG30COM1_POSN                 equ 0006h
LCDDATA15_SEG30COM1_POSITION             equ 0006h
LCDDATA15_SEG30COM1_SIZE                 equ 0001h
LCDDATA15_SEG30COM1_LENGTH               equ 0001h
LCDDATA15_SEG30COM1_MASK                 equ 0040h
LCDDATA15_SEG31COM1_POSN                 equ 0007h
LCDDATA15_SEG31COM1_POSITION             equ 0007h
LCDDATA15_SEG31COM1_SIZE                 equ 0001h
LCDDATA15_SEG31COM1_LENGTH               equ 0001h
LCDDATA15_SEG31COM1_MASK                 equ 0080h

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
LCDDATA16                                equ 07B0h
// bitfield definitions
LCDDATA16_SEG32COM1_POSN                 equ 0000h
LCDDATA16_SEG32COM1_POSITION             equ 0000h
LCDDATA16_SEG32COM1_SIZE                 equ 0001h
LCDDATA16_SEG32COM1_LENGTH               equ 0001h
LCDDATA16_SEG32COM1_MASK                 equ 0001h
LCDDATA16_SEG33COM1_POSN                 equ 0001h
LCDDATA16_SEG33COM1_POSITION             equ 0001h
LCDDATA16_SEG33COM1_SIZE                 equ 0001h
LCDDATA16_SEG33COM1_LENGTH               equ 0001h
LCDDATA16_SEG33COM1_MASK                 equ 0002h
LCDDATA16_SEG34COM1_POSN                 equ 0002h
LCDDATA16_SEG34COM1_POSITION             equ 0002h
LCDDATA16_SEG34COM1_SIZE                 equ 0001h
LCDDATA16_SEG34COM1_LENGTH               equ 0001h
LCDDATA16_SEG34COM1_MASK                 equ 0004h
LCDDATA16_SEG35COM1_POSN                 equ 0003h
LCDDATA16_SEG35COM1_POSITION             equ 0003h
LCDDATA16_SEG35COM1_SIZE                 equ 0001h
LCDDATA16_SEG35COM1_LENGTH               equ 0001h
LCDDATA16_SEG35COM1_MASK                 equ 0008h
LCDDATA16_SEG36COM1_POSN                 equ 0004h
LCDDATA16_SEG36COM1_POSITION             equ 0004h
LCDDATA16_SEG36COM1_SIZE                 equ 0001h
LCDDATA16_SEG36COM1_LENGTH               equ 0001h
LCDDATA16_SEG36COM1_MASK                 equ 0010h
LCDDATA16_SEG37COM1_POSN                 equ 0005h
LCDDATA16_SEG37COM1_POSITION             equ 0005h
LCDDATA16_SEG37COM1_SIZE                 equ 0001h
LCDDATA16_SEG37COM1_LENGTH               equ 0001h
LCDDATA16_SEG37COM1_MASK                 equ 0020h
LCDDATA16_SEG38COM1_POSN                 equ 0006h
LCDDATA16_SEG38COM1_POSITION             equ 0006h
LCDDATA16_SEG38COM1_SIZE                 equ 0001h
LCDDATA16_SEG38COM1_LENGTH               equ 0001h
LCDDATA16_SEG38COM1_MASK                 equ 0040h
LCDDATA16_SEG39COM1_POSN                 equ 0007h
LCDDATA16_SEG39COM1_POSITION             equ 0007h
LCDDATA16_SEG39COM1_SIZE                 equ 0001h
LCDDATA16_SEG39COM1_LENGTH               equ 0001h
LCDDATA16_SEG39COM1_MASK                 equ 0080h

// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
LCDDATA17                                equ 07B1h
// bitfield definitions
LCDDATA17_SEG40COM1_POSN                 equ 0000h
LCDDATA17_SEG40COM1_POSITION             equ 0000h
LCDDATA17_SEG40COM1_SIZE                 equ 0001h
LCDDATA17_SEG40COM1_LENGTH               equ 0001h
LCDDATA17_SEG40COM1_MASK                 equ 0001h
LCDDATA17_SEG41COM1_POSN                 equ 0001h
LCDDATA17_SEG41COM1_POSITION             equ 0001h
LCDDATA17_SEG41COM1_SIZE                 equ 0001h
LCDDATA17_SEG41COM1_LENGTH               equ 0001h
LCDDATA17_SEG41COM1_MASK                 equ 0002h
LCDDATA17_SEG42COM1_POSN                 equ 0002h
LCDDATA17_SEG42COM1_POSITION             equ 0002h
LCDDATA17_SEG42COM1_SIZE                 equ 0001h
LCDDATA17_SEG42COM1_LENGTH               equ 0001h
LCDDATA17_SEG42COM1_MASK                 equ 0004h
LCDDATA17_SEG43COM1_POSN                 equ 0003h
LCDDATA17_SEG43COM1_POSITION             equ 0003h
LCDDATA17_SEG43COM1_SIZE                 equ 0001h
LCDDATA17_SEG43COM1_LENGTH               equ 0001h
LCDDATA17_SEG43COM1_MASK                 equ 0008h
LCDDATA17_SEG44COM1_POSN                 equ 0004h
LCDDATA17_SEG44COM1_POSITION             equ 0004h
LCDDATA17_SEG44COM1_SIZE                 equ 0001h
LCDDATA17_SEG44COM1_LENGTH               equ 0001h
LCDDATA17_SEG44COM1_MASK                 equ 0010h
LCDDATA17_SEG45COM1_POSN                 equ 0005h
LCDDATA17_SEG45COM1_POSITION             equ 0005h
LCDDATA17_SEG45COM1_SIZE                 equ 0001h
LCDDATA17_SEG45COM1_LENGTH               equ 0001h
LCDDATA17_SEG45COM1_MASK                 equ 0020h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 07B2h
// bitfield definitions
LCDDATA18_SEG24COM2_POSN                 equ 0000h
LCDDATA18_SEG24COM2_POSITION             equ 0000h
LCDDATA18_SEG24COM2_SIZE                 equ 0001h
LCDDATA18_SEG24COM2_LENGTH               equ 0001h
LCDDATA18_SEG24COM2_MASK                 equ 0001h
LCDDATA18_SEG25COM2_POSN                 equ 0001h
LCDDATA18_SEG25COM2_POSITION             equ 0001h
LCDDATA18_SEG25COM2_SIZE                 equ 0001h
LCDDATA18_SEG25COM2_LENGTH               equ 0001h
LCDDATA18_SEG25COM2_MASK                 equ 0002h
LCDDATA18_SEG26COM2_POSN                 equ 0002h
LCDDATA18_SEG26COM2_POSITION             equ 0002h
LCDDATA18_SEG26COM2_SIZE                 equ 0001h
LCDDATA18_SEG26COM2_LENGTH               equ 0001h
LCDDATA18_SEG26COM2_MASK                 equ 0004h
LCDDATA18_SEG27COM2_POSN                 equ 0003h
LCDDATA18_SEG27COM2_POSITION             equ 0003h
LCDDATA18_SEG27COM2_SIZE                 equ 0001h
LCDDATA18_SEG27COM2_LENGTH               equ 0001h
LCDDATA18_SEG27COM2_MASK                 equ 0008h
LCDDATA18_SEG28COM2_POSN                 equ 0004h
LCDDATA18_SEG28COM2_POSITION             equ 0004h
LCDDATA18_SEG28COM2_SIZE                 equ 0001h
LCDDATA18_SEG28COM2_LENGTH               equ 0001h
LCDDATA18_SEG28COM2_MASK                 equ 0010h
LCDDATA18_SEG29COM2_POSN                 equ 0005h
LCDDATA18_SEG29COM2_POSITION             equ 0005h
LCDDATA18_SEG29COM2_SIZE                 equ 0001h
LCDDATA18_SEG29COM2_LENGTH               equ 0001h
LCDDATA18_SEG29COM2_MASK                 equ 0020h
LCDDATA18_SEG30COM2_POSN                 equ 0006h
LCDDATA18_SEG30COM2_POSITION             equ 0006h
LCDDATA18_SEG30COM2_SIZE                 equ 0001h
LCDDATA18_SEG30COM2_LENGTH               equ 0001h
LCDDATA18_SEG30COM2_MASK                 equ 0040h
LCDDATA18_SEG31COM2_POSN                 equ 0007h
LCDDATA18_SEG31COM2_POSITION             equ 0007h
LCDDATA18_SEG31COM2_SIZE                 equ 0001h
LCDDATA18_SEG31COM2_LENGTH               equ 0001h
LCDDATA18_SEG31COM2_MASK                 equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 07B3h
// bitfield definitions
LCDDATA19_SEG32COM2_POSN                 equ 0000h
LCDDATA19_SEG32COM2_POSITION             equ 0000h
LCDDATA19_SEG32COM2_SIZE                 equ 0001h
LCDDATA19_SEG32COM2_LENGTH               equ 0001h
LCDDATA19_SEG32COM2_MASK                 equ 0001h
LCDDATA19_SEG33COM2_POSN                 equ 0001h
LCDDATA19_SEG33COM2_POSITION             equ 0001h
LCDDATA19_SEG33COM2_SIZE                 equ 0001h
LCDDATA19_SEG33COM2_LENGTH               equ 0001h
LCDDATA19_SEG33COM2_MASK                 equ 0002h
LCDDATA19_SEG34COM2_POSN                 equ 0002h
LCDDATA19_SEG34COM2_POSITION             equ 0002h
LCDDATA19_SEG34COM2_SIZE                 equ 0001h
LCDDATA19_SEG34COM2_LENGTH               equ 0001h
LCDDATA19_SEG34COM2_MASK                 equ 0004h
LCDDATA19_SEG35COM2_POSN                 equ 0003h
LCDDATA19_SEG35COM2_POSITION             equ 0003h
LCDDATA19_SEG35COM2_SIZE                 equ 0001h
LCDDATA19_SEG35COM2_LENGTH               equ 0001h
LCDDATA19_SEG35COM2_MASK                 equ 0008h
LCDDATA19_SEG36COM2_POSN                 equ 0004h
LCDDATA19_SEG36COM2_POSITION             equ 0004h
LCDDATA19_SEG36COM2_SIZE                 equ 0001h
LCDDATA19_SEG36COM2_LENGTH               equ 0001h
LCDDATA19_SEG36COM2_MASK                 equ 0010h
LCDDATA19_SEG37COM2_POSN                 equ 0005h
LCDDATA19_SEG37COM2_POSITION             equ 0005h
LCDDATA19_SEG37COM2_SIZE                 equ 0001h
LCDDATA19_SEG37COM2_LENGTH               equ 0001h
LCDDATA19_SEG37COM2_MASK                 equ 0020h
LCDDATA19_SEG38COM2_POSN                 equ 0006h
LCDDATA19_SEG38COM2_POSITION             equ 0006h
LCDDATA19_SEG38COM2_SIZE                 equ 0001h
LCDDATA19_SEG38COM2_LENGTH               equ 0001h
LCDDATA19_SEG38COM2_MASK                 equ 0040h
LCDDATA19_SEG39COM2_POSN                 equ 0007h
LCDDATA19_SEG39COM2_POSITION             equ 0007h
LCDDATA19_SEG39COM2_SIZE                 equ 0001h
LCDDATA19_SEG39COM2_LENGTH               equ 0001h
LCDDATA19_SEG39COM2_MASK                 equ 0080h

