GopalSaraf/Practicals/PSDL/include/proc/pic16lf1947.inc
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P1A                              BANKMASK(PORTC), 2
#define P1BSEL                           BANKMASK(APFCON), 0
#define P1CSEL                           BANKMASK(APFCON), 1
#define P1D                              BANKMASK(PORTG), 4
#define P1DC0                            BANKMASK(PWM1CON), 0
#define P1DC1                            BANKMASK(PWM1CON), 1
#define P1DC2                            BANKMASK(PWM1CON), 2
#define P1DC3                            BANKMASK(PWM1CON), 3
#define P1DC4                            BANKMASK(PWM1CON), 4
#define P1DC5                            BANKMASK(PWM1CON), 5
#define P1DC6                            BANKMASK(PWM1CON), 6
#define P1M0                             BANKMASK(CCP1CON), 6
#define P1M1                             BANKMASK(CCP1CON), 7
#define P1RSEN                           BANKMASK(PWM1CON), 7
#define P2BSEL                           BANKMASK(APFCON), 3
#define P2CSEL                           BANKMASK(APFCON), 4
#define P2DC0                            BANKMASK(PWM2CON), 0
#define P2DC1                            BANKMASK(PWM2CON), 1
#define P2DC2                            BANKMASK(PWM2CON), 2
#define P2DC3                            BANKMASK(PWM2CON), 3
#define P2DC4                            BANKMASK(PWM2CON), 4
#define P2DC5                            BANKMASK(PWM2CON), 5
#define P2DC6                            BANKMASK(PWM2CON), 6
#define P2DSEL                           BANKMASK(APFCON), 5
#define P2M0                             BANKMASK(CCP2CON), 6
#define P2M1                             BANKMASK(CCP2CON), 7
#define P2RSEN                           BANKMASK(PWM2CON), 7
#define P3A                              BANKMASK(PORTG), 0
#define P3BSEL                           BANKMASK(APFCON), 6
#define P3CSEL                           BANKMASK(APFCON), 7
#define P3D                              BANKMASK(PORTG), 3
#define P3DC0                            BANKMASK(PWM3CON), 0
#define P3DC1                            BANKMASK(PWM3CON), 1
#define P3DC2                            BANKMASK(PWM3CON), 2
#define P3DC3                            BANKMASK(PWM3CON), 3
#define P3DC4                            BANKMASK(PWM3CON), 4
#define P3DC5                            BANKMASK(PWM3CON), 5
#define P3DC6                            BANKMASK(PWM3CON), 6
#define P3M0                             BANKMASK(CCP3CON), 6
#define P3M1                             BANKMASK(CCP3CON), 7
#define P3RSEN                           BANKMASK(PWM3CON), 7
#define PEIE                             BANKMASK(INTCON), 6
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PSS1AC0                          BANKMASK(CCP1AS), 2
#define PSS1AC1                          BANKMASK(CCP1AS), 3
#define PSS1BD0                          BANKMASK(CCP1AS), 0
#define PSS1BD1                          BANKMASK(CCP1AS), 1
#define PSS2AC0                          BANKMASK(CCP2AS), 2
#define PSS2AC1                          BANKMASK(CCP2AS), 3
#define PSS2BD0                          BANKMASK(CCP2AS), 0
#define PSS2BD1                          BANKMASK(CCP2AS), 1
#define PSS3AC0                          BANKMASK(CCP3AS), 2
#define PSS3AC1                          BANKMASK(CCP3AS), 3
#define PSS3BD0                          BANKMASK(CCP3AS), 0
#define PSS3BD1                          BANKMASK(CCP3AS), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC1IE                            BANKMASK(PIE1), 5
#define RC1IF                            BANKMASK(PIR1), 5
#define RC2                              BANKMASK(PORTC), 2
#define RC2IE                            BANKMASK(PIE4), 5
#define RC2IF                            BANKMASK(PIR4), 5
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD1                              BANKMASK(PORTD), 1
#define RD2                              BANKMASK(PORTD), 2
#define RD3                              BANKMASK(PORTD), 3
#define RD4                              BANKMASK(PORTD), 4
#define RD5                              BANKMASK(PORTD), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD7                              BANKMASK(PORTD), 7
#define RE0                              BANKMASK(PORTE), 0
#define RE1                              BANKMASK(PORTE), 1
#define RE2                              BANKMASK(PORTE), 2
#define RE3                              BANKMASK(PORTE), 3
#define RE4                              BANKMASK(PORTE), 4
#define RE5                              BANKMASK(PORTE), 5
#define RE6                              BANKMASK(PORTE), 6
#define RE7                              BANKMASK(PORTE), 7
#define RF0                              BANKMASK(PORTF), 0
#define RF1                              BANKMASK(PORTF), 1
#define RF2                              BANKMASK(PORTF), 2
#define RF3                              BANKMASK(PORTF), 3
#define RF4                              BANKMASK(PORTF), 4
#define RF5                              BANKMASK(PORTF), 5
#define RF6                              BANKMASK(PORTF), 6
#define RF7                              BANKMASK(PORTF), 7
#define RG0                              BANKMASK(PORTG), 0
#define RG1                              BANKMASK(PORTG), 1
#define RG2                              BANKMASK(PORTG), 2
#define RG3                              BANKMASK(PORTG), 3
#define RG4                              BANKMASK(PORTG), 4
#define RG5                              BANKMASK(PORTG), 5
#define RX1                              BANKMASK(PORTC), 7
#define RX2                              BANKMASK(PORTG), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCK1                             BANKMASK(PORTC), 3
#define SCK2                             BANKMASK(PORTD), 6
#define SCL1                             BANKMASK(PORTC), 3
#define SCL2                             BANKMASK(PORTD), 6
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDA1                             BANKMASK(PORTC), 4
#define SDA2                             BANKMASK(PORTD), 5
#define SDI1                             BANKMASK(PORTC), 4
#define SDI2                             BANKMASK(PORTD), 5
#define SDO1                             BANKMASK(PORTC), 5
#define SDO2                             BANKMASK(PORTD), 4
#define SE0                              BANKMASK(LCDSE0), 0
#define SE1                              BANKMASK(LCDSE0), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE16                             BANKMASK(LCDSE2), 0
#define SE17                             BANKMASK(LCDSE2), 1
#define SE18                             BANKMASK(LCDSE2), 2
#define SE19                             BANKMASK(LCDSE2), 3
#define SE2                              BANKMASK(LCDSE0), 2
#define SE20                             BANKMASK(LCDSE2), 4
#define SE21                             BANKMASK(LCDSE2), 5
#define SE22                             BANKMASK(LCDSE2), 6
#define SE23                             BANKMASK(LCDSE2), 7
#define SE24                             BANKMASK(LCDSE3), 0
#define SE25                             BANKMASK(LCDSE3), 1
#define SE26                             BANKMASK(LCDSE3), 2
#define SE27                             BANKMASK(LCDSE3), 3
#define SE28                             BANKMASK(LCDSE3), 4
#define SE29                             BANKMASK(LCDSE3), 5
#define SE3                              BANKMASK(LCDSE0), 3
#define SE30                             BANKMASK(LCDSE3), 6
#define SE31                             BANKMASK(LCDSE3), 7
#define SE32                             BANKMASK(LCDSE4), 0
#define SE33                             BANKMASK(LCDSE4), 1
#define SE34                             BANKMASK(LCDSE4), 2
#define SE35                             BANKMASK(LCDSE4), 3
#define SE36                             BANKMASK(LCDSE4), 4
#define SE37                             BANKMASK(LCDSE4), 5
#define SE38                             BANKMASK(LCDSE4), 6
#define SE39                             BANKMASK(LCDSE4), 7
#define SE4                              BANKMASK(LCDSE0), 4
#define SE40                             BANKMASK(LCDSE5), 0
#define SE41                             BANKMASK(LCDSE5), 1
#define SE42                             BANKMASK(LCDSE5), 2
#define SE43                             BANKMASK(LCDSE5), 3
#define SE44                             BANKMASK(LCDSE5), 4
#define SE45                             BANKMASK(LCDSE5), 5
#define SE5                              BANKMASK(LCDSE0), 5
#define SE6                              BANKMASK(LCDSE0), 6
#define SE7                              BANKMASK(LCDSE0), 7
#define SE8                              BANKMASK(LCDSE1), 0
#define SE9                              BANKMASK(LCDSE1), 1
#define SEG0                             BANKMASK(PORTD), 0
#define SEG0COM0                         BANKMASK(LCDDATA0), 0
#define SEG0COM1                         BANKMASK(LCDDATA3), 0
#define SEG0COM2                         BANKMASK(LCDDATA6), 0
#define SEG0COM3                         BANKMASK(LCDDATA9), 0
#define SEG1                             BANKMASK(PORTD), 1
#define SEG10                            BANKMASK(PORTB), 3
#define SEG10COM0                        BANKMASK(LCDDATA1), 2
#define SEG10COM1                        BANKMASK(LCDDATA4), 2
#define SEG10COM2                        BANKMASK(LCDDATA7), 2
#define SEG10COM3                        BANKMASK(LCDDATA10), 2
#define SEG11                            BANKMASK(PORTB), 4
#define SEG11COM0                        BANKMASK(LCDDATA1), 3
#define SEG11COM1                        BANKMASK(LCDDATA4), 3
#define SEG11COM2                        BANKMASK(LCDDATA7), 3
#define SEG11COM3                        BANKMASK(LCDDATA10), 3
#define SEG12                            BANKMASK(PORTC), 5
#define SEG12COM0                        BANKMASK(LCDDATA1), 4
#define SEG12COM1                        BANKMASK(LCDDATA4), 4
#define SEG12COM2                        BANKMASK(LCDDATA7), 4
#define SEG12COM3                        BANKMASK(LCDDATA10), 4
#define SEG13                            BANKMASK(PORTC), 2
#define SEG13COM0                        BANKMASK(LCDDATA1), 5
#define SEG13COM1                        BANKMASK(LCDDATA4), 5
#define SEG13COM2                        BANKMASK(LCDDATA7), 5
#define SEG13COM3                        BANKMASK(LCDDATA10), 5
#define SEG14                            BANKMASK(PORTA), 4
#define SEG14COM0                        BANKMASK(LCDDATA1), 6
#define SEG14COM1                        BANKMASK(LCDDATA4), 6
#define SEG14COM2                        BANKMASK(LCDDATA7), 6
#define SEG14COM3                        BANKMASK(LCDDATA10), 6
#define SEG15                            BANKMASK(PORTA), 5
#define SEG15COM0                        BANKMASK(LCDDATA1), 7
#define SEG15COM1                        BANKMASK(LCDDATA4), 7
#define SEG15COM2                        BANKMASK(LCDDATA7), 7
#define SEG15COM3                        BANKMASK(LCDDATA10), 7
#define SEG16                            BANKMASK(PORTC), 4
#define SEG16COM0                        BANKMASK(LCDDATA2), 0
#define SEG16COM1                        BANKMASK(LCDDATA5), 0
#define SEG16COM2                        BANKMASK(LCDDATA8), 0
#define SEG16COM3                        BANKMASK(LCDDATA11), 0
#define SEG17                            BANKMASK(PORTC), 3
#define SEG17COM0                        BANKMASK(LCDDATA2), 1
#define SEG17COM1                        BANKMASK(LCDDATA5), 1
#define SEG17COM2                        BANKMASK(LCDDATA8), 1
#define SEG17COM3                        BANKMASK(LCDDATA11), 1
#define SEG18                            BANKMASK(PORTA), 1
#define SEG18COM0                        BANKMASK(LCDDATA2), 2
#define SEG18COM1                        BANKMASK(LCDDATA5), 2
#define SEG18COM2                        BANKMASK(LCDDATA8), 2
#define SEG18COM3                        BANKMASK(LCDDATA11), 2
#define SEG19                            BANKMASK(PORTF), 1
#define SEG19COM0                        BANKMASK(LCDDATA2), 3
#define SEG19COM1                        BANKMASK(LCDDATA5), 3
#define SEG19COM2                        BANKMASK(LCDDATA8), 3
#define SEG19COM3                        BANKMASK(LCDDATA11), 3
#define SEG1COM0                         BANKMASK(LCDDATA0), 1
#define SEG1COM1                         BANKMASK(LCDDATA3), 1
#define SEG1COM2                         BANKMASK(LCDDATA6), 1
#define SEG1COM3                         BANKMASK(LCDDATA9), 1
#define SEG2                             BANKMASK(PORTD), 2
#define SEG20                            BANKMASK(PORTF), 2
#define SEG20COM0                        BANKMASK(LCDDATA2), 4
#define SEG20COM1                        BANKMASK(LCDDATA5), 4
#define SEG20COM2                        BANKMASK(LCDDATA8), 4
#define SEG20COM3                        BANKMASK(LCDDATA11), 4
#define SEG21                            BANKMASK(PORTF), 3
#define SEG21COM0                        BANKMASK(LCDDATA2), 5
#define SEG21COM1                        BANKMASK(LCDDATA5), 5
#define SEG21COM2                        BANKMASK(LCDDATA8), 5
#define SEG21COM3                        BANKMASK(LCDDATA11), 5
#define SEG22                            BANKMASK(PORTF), 4
#define SEG22COM0                        BANKMASK(LCDDATA2), 6
#define SEG22COM1                        BANKMASK(LCDDATA5), 6
#define SEG22COM2                        BANKMASK(LCDDATA8), 6
#define SEG22COM3                        BANKMASK(LCDDATA11), 6
#define SEG23                            BANKMASK(PORTF), 5
#define SEG23COM0                        BANKMASK(LCDDATA2), 7
#define SEG23COM1                        BANKMASK(LCDDATA5), 7
#define SEG23COM2                        BANKMASK(LCDDATA8), 7
#define SEG23COM3                        BANKMASK(LCDDATA11), 7
#define SEG24                            BANKMASK(PORTF), 6
#define SEG24COM0                        BANKMASK(LCDDATA12), 0
#define SEG24COM1                        BANKMASK(LCDDATA15), 0
#define SEG24COM2                        BANKMASK(LCDDATA18), 0
#define SEG24COM3                        BANKMASK(LCDDATA21), 0
#define SEG25                            BANKMASK(PORTF), 7
#define SEG25COM0                        BANKMASK(LCDDATA12), 1
#define SEG25COM1                        BANKMASK(LCDDATA15), 1
#define SEG25COM2                        BANKMASK(LCDDATA18), 1
#define SEG25COM3                        BANKMASK(LCDDATA21), 1
#define SEG26                            BANKMASK(PORTG), 4
#define SEG26COM0                        BANKMASK(LCDDATA12), 2
#define SEG26COM1                        BANKMASK(LCDDATA15), 2
#define SEG26COM2                        BANKMASK(LCDDATA18), 2
#define SEG26COM3                        BANKMASK(LCDDATA21), 2
#define SEG27                            BANKMASK(PORTC), 6
#define SEG27COM0                        BANKMASK(LCDDATA12), 3
#define SEG27COM1                        BANKMASK(LCDDATA15), 3
#define SEG27COM2                        BANKMASK(LCDDATA18), 3
#define SEG27COM3                        BANKMASK(LCDDATA21), 3
#define SEG28                            BANKMASK(PORTC), 7
#define SEG28COM0                        BANKMASK(LCDDATA12), 4
#define SEG28COM1                        BANKMASK(LCDDATA15), 4
#define SEG28COM2                        BANKMASK(LCDDATA18), 4
#define SEG28COM3                        BANKMASK(LCDDATA21), 4
#define SEG29                            BANKMASK(PORTB), 5
#define SEG29COM0                        BANKMASK(LCDDATA12), 5
#define SEG29COM1                        BANKMASK(LCDDATA15), 5
#define SEG29COM2                        BANKMASK(LCDDATA18), 5
#define SEG29COM3                        BANKMASK(LCDDATA21), 5
#define SEG2COM0                         BANKMASK(LCDDATA0), 2
#define SEG2COM1                         BANKMASK(LCDDATA3), 2
#define SEG2COM2                         BANKMASK(LCDDATA6), 2
#define SEG2COM3                         BANKMASK(LCDDATA9), 2
#define SEG3                             BANKMASK(PORTD), 3
#define SEG30                            BANKMASK(PORTB), 0
#define SEG30COM0                        BANKMASK(LCDDATA12), 6
#define SEG30COM1                        BANKMASK(LCDDATA15), 6
#define SEG30COM2                        BANKMASK(LCDDATA18), 6
#define SEG30COM3                        BANKMASK(LCDDATA21), 6
#define SEG31                            BANKMASK(PORTE), 7
#define SEG31COM0                        BANKMASK(LCDDATA12), 7
#define SEG31COM1                        BANKMASK(LCDDATA15), 7
#define SEG31COM2                        BANKMASK(LCDDATA18), 7
#define SEG31COM3                        BANKMASK(LCDDATA21), 7
#define SEG32                            BANKMASK(PORTC), 1
#define SEG32COM0                        BANKMASK(LCDDATA13), 0
#define SEG32COM1                        BANKMASK(LCDDATA16), 0
#define SEG32COM2                        BANKMASK(LCDDATA19), 0
#define SEG32COM3                        BANKMASK(LCDDATA22), 0
#define SEG33                            BANKMASK(PORTA), 0
#define SEG33COM0                        BANKMASK(LCDDATA13), 1
#define SEG33COM1                        BANKMASK(LCDDATA16), 1
#define SEG33COM2                        BANKMASK(LCDDATA19), 1
#define SEG33COM3                        BANKMASK(LCDDATA22), 1
#define SEG34                            BANKMASK(PORTA), 2
#define SEG34COM0                        BANKMASK(LCDDATA13), 2
#define SEG34COM1                        BANKMASK(LCDDATA16), 2
#define SEG34COM2                        BANKMASK(LCDDATA19), 2
#define SEG34COM3                        BANKMASK(LCDDATA22), 2
#define SEG35                            BANKMASK(PORTA), 3
#define SEG35COM0                        BANKMASK(LCDDATA13), 3
#define SEG35COM1                        BANKMASK(LCDDATA16), 3
#define SEG35COM2                        BANKMASK(LCDDATA19), 3
#define SEG35COM3                        BANKMASK(LCDDATA22), 3
#define SEG36                            BANKMASK(PORTA), 6
#define SEG36COM0                        BANKMASK(LCDDATA13), 4
#define SEG36COM1                        BANKMASK(LCDDATA16), 4
#define SEG36COM2                        BANKMASK(LCDDATA19), 4
#define SEG36COM3                        BANKMASK(LCDDATA22), 4
#define SEG37                            BANKMASK(PORTA), 7
#define SEG37COM0                        BANKMASK(LCDDATA13), 5
#define SEG37COM1                        BANKMASK(LCDDATA16), 5
#define SEG37COM2                        BANKMASK(LCDDATA19), 5
#define SEG37COM3                        BANKMASK(LCDDATA22), 5
#define SEG38                            BANKMASK(PORTB), 6
#define SEG38COM0                        BANKMASK(LCDDATA13), 6
#define SEG38COM1                        BANKMASK(LCDDATA16), 6
#define SEG38COM2                        BANKMASK(LCDDATA19), 6
#define SEG38COM3                        BANKMASK(LCDDATA22), 6
#define SEG39                            BANKMASK(PORTB), 7
#define SEG39COM0                        BANKMASK(LCDDATA13), 7
#define SEG39COM1                        BANKMASK(LCDDATA16), 7
#define SEG39COM2                        BANKMASK(LCDDATA19), 7
#define SEG39COM3                        BANKMASK(LCDDATA22), 7
#define SEG3COM0                         BANKMASK(LCDDATA0), 3
#define SEG3COM1                         BANKMASK(LCDDATA3), 3
#define SEG3COM2                         BANKMASK(LCDDATA6), 3
#define SEG3COM3                         BANKMASK(LCDDATA9), 3
#define SEG4                             BANKMASK(PORTD), 4
#define SEG40                            BANKMASK(PORTC), 0
#define SEG40COM0                        BANKMASK(LCDDATA14), 0
#define SEG40COM1                        BANKMASK(LCDDATA17), 0
#define SEG40COM2                        BANKMASK(LCDDATA20), 0
#define SEG40COM3                        BANKMASK(LCDDATA23), 0
#define SEG41                            BANKMASK(PORTF), 0
#define SEG41COM0                        BANKMASK(LCDDATA14), 1
#define SEG41COM1                        BANKMASK(LCDDATA17), 1
#define SEG41COM2                        BANKMASK(LCDDATA20), 1
#define SEG41COM3                        BANKMASK(LCDDATA23), 1
#define SEG42                            BANKMASK(PORTG), 0
#define SEG42COM0                        BANKMASK(LCDDATA14), 2
#define SEG42COM1                        BANKMASK(LCDDATA17), 2
#define SEG42COM2                        BANKMASK(LCDDATA20), 2
#define SEG42COM3                        BANKMASK(LCDDATA23), 2
#define SEG43                            BANKMASK(PORTG), 1
#define SEG43COM0                        BANKMASK(LCDDATA14), 3
#define SEG43COM1                        BANKMASK(LCDDATA17), 3
#define SEG43COM2                        BANKMASK(LCDDATA20), 3
#define SEG43COM3                        BANKMASK(LCDDATA23), 3
#define SEG44                            BANKMASK(PORTG), 2
#define SEG44COM0                        BANKMASK(LCDDATA14), 4
#define SEG44COM1                        BANKMASK(LCDDATA17), 4
#define SEG44COM2                        BANKMASK(LCDDATA20), 4
#define SEG44COM3                        BANKMASK(LCDDATA23), 4
#define SEG45                            BANKMASK(PORTG), 3
#define SEG45COM0                        BANKMASK(LCDDATA14), 5
#define SEG45COM1                        BANKMASK(LCDDATA17), 5
#define SEG45COM2                        BANKMASK(LCDDATA20), 5
#define SEG45COM3                        BANKMASK(LCDDATA23), 5
#define SEG4COM0                         BANKMASK(LCDDATA0), 4
#define SEG4COM1                         BANKMASK(LCDDATA3), 4
#define SEG4COM2                         BANKMASK(LCDDATA6), 4
#define SEG4COM3                         BANKMASK(LCDDATA9), 4
